SIN TERMINAR

In [2]:
import pandas as pd
import numpy as np

**Pair Programming Pandas VI**

Es el momento de poner en pr치ctica los groupby de pandas. Para esto vamos a trabajar con el csv creado en el ejercicio de pair programming anterior. El objetivo de este ejercicio es agrupar los datos para contestar las siguientes preguntas:

In [3]:
tabla2 = pd.read_csv("tablas_unidas2.csv")
tabla2.head()

,CASE_NUMBER,YEAR,TYPE,COUNTRY,AREA,LOCATION,ACTIVITY,NAME,SEX_,AGE,...,HREF FORMULA,CASE NUMBER.1,CASE NUMBER.2,ORIGINAL ORDER,UNNAMED:22,UNNAMED: 23,UNNAMED: 0_y,FATAL (Y/N),INJURY,DATE
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,...,NaN,NaN,NaN,NaN,NaN,NaN,5472,N,Lacerations to leg from hooked shark PROVOKED ...,Reported 06-Sep-1905
1,2018.06.03.a,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,...,NaN,NaN,NaN,NaN,NaN,NaN,5472,N,Lacerations to leg from hooked shark PROVOKED ...,Reported 06-Sep-1905
2,2018.05.26.b,2018.0,Unprovoked,USA,Florida,"Cocoa Beach, Brevard County",Walking,Cody High,M,15,...,NaN,NaN,NaN,NaN,NaN,NaN,5472,N,Lacerations to leg from hooked shark PROVOKED ...,Reported 06-Sep-1905
3,2018.05.24,2018.0,Provoked,AUSTRALIA,Queensland,Cairns Aquarium,Feeding sharks,male,M,32,...,NaN,NaN,NaN,NaN,NaN,NaN,5472,N,Lacerations to leg from hooked shark PROVOKED ...,Reported 06-Sep-1905
4,2018.05.13.a,2018.0,Invalid,ENGLAND,Cornwall,Off Land's End,Fishing,Max Berryman,M,21,...,NaN,NaN,NaN,NaN,NaN,NaN,5472,N,Lacerations to leg from hooked shark PROVOKED ...,Reported 06-Sep-1905

In [4]:
tabla2.columns

Index(['CASE_NUMBER', 'YEAR', 'TYPE', 'COUNTRY', 'AREA', 'LOCATION',
       'ACTIVITY', 'NAME', 'SEX_', 'AGE', 'TIME', 'SPECIES_', 'PDF', 'HREF',
       'UNNAMED: 0_x', 'CASE NUMBER', 'SEX ', 'SPECIES ',
       'INVESTIGATOR OR SOURCE', 'HREF FORMULA', 'CASE NUMBER.1',
       'CASE NUMBER.2', 'ORIGINAL ORDER', 'UNNAMED:22', 'UNNAMED: 23',
       'UNNAMED: 0_y', 'FATAL (Y/N)', 'INJURY', 'DATE'],
      dtype='object')

1. 쮺u치ntos ataques hubo por pa칤s? Devuelve un DataFrame.

游늷 NOTA Ordena los resultados de mayor a menor. Esto todav칤a no lo hemos visto, pero un DataFrame lo podemos ordenar con .sort_values(). Aqu칤 ten칠is una explicaci칩n de c칩mo hacerlo.

In [5]:
#agrupamos por pais
tabla2_groupby_ataques = tabla2.groupby("COUNTRY")
tabla2_groupby_ataques

In [6]:
# para acceder al n칰mero de grupos que tenemos.
tabla2_groupby_ataques.ngroups

95

In [7]:
#indice de los elementos
grupos_ataques = tabla2_groupby_ataques.groups
grupos_ataques

{'AMERICAN SAMOA': [1365, 1392], 'ARGENTINA': [1397], 'ASIA?': [1661], 'AUSTRALIA': [3, 6, 11, 12, 13, 14, 15, 19, 21, 22, 27, 28, 38, 41, 44, 46, 49, 50, 51, 54, 60, 63, 68, 70, 77, 82, 83, 85, 87, 102, 105, 114, 117, 119, 120, 128, 138, 139, 146, 147, 148, 152, 154, 155, 159, 163, 164, 177, 179, 182, 183, 191, 192, 193, 196, 198, 203, 223, 230, 235, 236, 237, 239, 249, 255, 257, 262, 266, 268, 277, 278, 282, 284, 285, 287, 288, 289, 290, 291, 292, 298, 301, 314, 317, 318, 319, 321, 324, 331, 334, 336, 337, 356, 357, 358, 363, 369, 370, 379, 388, ...], 'BAHAMAS': [39, 150, 174, 213, 215, 323, 442, 457, 477, 614, 642, 644, 709, 732, 737, 794, 818, 906, 918, 1099, 1164, 1205, 1367, 1372, 1438, 1446, 1586, 1614, 1620], 'BAHREIN': [1585], 'BARBADOS': [1508, 1530, 1533], 'BELIZE': [1646], 'BERMUDA': [1336, 1340, 1562, 1616], 'BRAZIL': [1, 16, 142, 426, 529, 599, 612, 619, 653, 678, 688, 699, 785, 787, 804, 815], 'BRITISH WEST INDIES': [1284], 'BURMA': [1640, 1643], 'Between PORTUGAL & INDIA': [1540], 'CANADA': [1551], 'CEYLON (SRI LANKA)': [1671], 'COLUMBIA': [1192], 'COSTA RICA': [5], 'CROATIA': [408, 1177, 1310], 'CUBA': [20, 398, 591, 1522, 1624], 'DJIBOUTI': [1572], 'ECUADOR': [86, 219], 'EGYPT': [69, 326, 327, 328, 329, 330, 354, 381, 458], 'EL SALVADOR': [1412], 'ENGLAND': [4, 481, 1504, 1509], 'FEDERATED STATES OF MICRONESIA': [1270], 'FIJI': [531, 752, 844, 1250, 1264, 1276, 1351, 1608, 1617, 1657], 'FRANCE': [1517, 1531, 1532, 1542], 'FRENCH POLYNESIA': [78, 79, 134, 144, 185, 226, 233, 305, 1591], 'GRAND CAYMAN': [555], 'GREECE': [1271, 1419, 1548, 1549, 1563, 1581, 1601, 1645], 'GREENLAND': [1515], 'GUAM': [359, 386], 'GUINEA': [1514, 1534], 'HONG KONG': [891, 967], 'ICELAND': [1527], 'INDIA': [1501, 1536, 1537, 1539, 1565, 1622], 'INDONESIA': [45, 76, 1414, 1621], 'IRAN': [1595, 1632, 1633, 1634], 'IRAQ': [1430, 1448, 1611, 1612, 1613, 1635], 'ISRAEL': [1155], 'ITALY': [267, 963, 999, 1049, 1285, 1315, 1482, 1526, 1529, 1550, 1644], 'JAMAICA': [229, 1488, 1510, 1520], 'JAPAN': [892, 949, 1354], 'KENYA': [1552, 1553], 'KIRIBATI': [1626, 1628], 'KOREA': [1590], 'LEBANON': [1566], 'LIBYA': [1573], 'MADAGASCAR': [1618], 'MALDIVES': [7], 'MARSHALL ISLANDS': [791, 1303, 1625], 'MARTINIQUE': [1511], 'MAURITIUS': [805], 'MEDITERRANEAN SEA': [1519, 1604], 'MEXICO': [222, 241, 270, 322, 427, 430, 434, 724, 1116, 1165, 1245, 1283, 1399, 1433, 1544], 'MICRONESIA': [1182], 'MOZAMBIQUE': [362, 828, 833, 1167, 1172, 1319, 1321, 1582, 1609], 'NEW BRITAIN': [1214, 1215], 'NEW CALEDONIA': [80, 187, 313, 320, 429, 432, 456, 491, 496, 783], 'NEW ZEALAND': [75, 186, 231, 316, 360, 403, 502, 585, 622, 664, 857, 1181, 1190, 1191, 1209, 1252, 1254, 1262, 1297, 1302, 1575], 'NICARAGUA': [1623], 'NORTH PACIFIC OCEAN': [1324, 1627], 'OKINAWA': [763], 'PACIFIC OCEAN': [1370, 1639], 'PALAU': [1234, 1265], 'PANAMA': [1432, 1475, 1524, 1554, 1670], 'PAPUA NEW GUINEA': [297, 1210, 1211, 1241, 1263, 1272, 1286, 1294, 1301, 1386, 1391, 1398, 1558, 1597, 1641, 1642], 'PHILIPPINES': [1353], 'RED SEA?': [1598], 'REUNION': [133, 140, 145, 197, 220, 355, 596, 620, 767, 806, 872, 902, 946, 964, 1111, 1588, 1648], 'ROATAN': [1528], 'RUSSIA': [304], 'SAUDI ARABIA': [1636, 1637, 1638], 'SCOTLAND': [372], 'SENEGAL': [1387], 'SEYCHELLES': [306, 1502, 1610], 'SINGAPORE': [1607], 'SOLOMON ISLANDS': [1267, 1589, 1630], 'SOUTH AFRICA': [8, 9, 37, 47, 90, 124, 125, 136, 151, 171, 184, 188, 202, 228, 259, 275, 286, 294, 302, 307, 308, 312, 353, 361, 375, 389, 393, 399, 406, 422, 447, 450, 498, 504, 512, 514, 528, 535, 547, 551, 556, 576, 578, 582, 588, 589, 592, 595, 610, 617, 626, 638, 641, 669, 670, 689, 703, 720, 721, 748, 765, 795, 798, 800, 810, 811, 819, 820, 822, 823, 824, 827, 830, 834, 842, 860, 865, 894, 895, 896, 903, 904, 910, 911, 916, 921, 947, 953, 954, 971, 977, 981, 982, 983, 985, 989, 993, 995, 996, 997, ...], 'SOUTH KOREA': [1101], 'SPAIN': [29, 59, 112, 341, 917, 1518, 1567], 'SRI LANKA': [1578], 'ST. MAARTIN': [550], 'SUDAN': [1568, 1592], 'SWEDEN': [1523], 'TAIWAN': [382, 1244, 1375], 'THAILAND': [106], 'TONGA': [536, 685, 884], 'TURKS & CAICOS': [674], 'UNITED KINGDOM': [373], 'URUGUAY': [1555, 1556], 'USA': [0, 2, 10, 17, 18, 23, 24, 25, 26, 30, 31, 32, 33, 34, 35, 36, 40, 42, 43, 48, 52, 53, 55, 56, 57, 58, 61, 62, 64, 65, 66, 67, 71, 72, 73, 74, 81, 84, 88, 89, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 103, 104, 107, 108, 109, 110, 111, 113, 115, 116, 118, 121, 122, 123, 126, 127, 129, 130, 131, 132, 135, 137, 141, 143, 149, 153, 156, 157, 158, 160, 161, 162, 165, 166, 167, 168, 169, 170, 172, 173, 175, 176, 178, 180, 181, 189, 190, 194, 195, ...], 'VANUATU': [572, 1027, 1593, 1594], 'VENEZUELA': [625, 662, 1543, 1579], 'VIETNAM': [345, 348, 349, 1577, 1654]}

In [8]:
ataques_paises2 = tabla2.groupby("COUNTRY")["CASE NUMBER"].count()
ataques_paises2.head()

COUNTRY
AMERICAN SAMOA     0
ARGENTINA          0
ASIA?              1
AUSTRALIA         19
BAHAMAS            3
Name: CASE NUMBER, dtype: int64

In [9]:
ataquespaises2 = pd.DataFrame(list(ataques_paises2.items()), columns=['PAISES', 'CASOS'])
ataquespaises2

            PAISES  CASOS
0   AMERICAN SAMOA      0
1        ARGENTINA      0
2            ASIA?      1
3        AUSTRALIA     19
4          BAHAMAS      3
..             ...    ...
90         URUGUAY      2
91             USA     22
92         VANUATU      2
93       VENEZUELA      2
94         VIETNAM      2

[95 rows x 2 columns]

In [10]:
ataquespaises2_ordenado = ataquespaises2.sort_values('CASOS')
ataquespaises2_ordenado.head()

            PAISES  CASOS
0   AMERICAN SAMOA      0
20         ECUADOR      0
21           EGYPT      0
22     EL SALVADOR      0
49        MALDIVES      0

2. 쮺u치ntos ataques ha habido por a침o? Devuelve un DataFrame. De nuevo ordena los resultados de mayor a menor.

In [11]:
#agrupamos por a침o
tabla2_groupby_a침o = tabla2.groupby("YEAR")
tabla2_groupby_a침o

In [12]:
# para acceder al n칰mero de grupos que tenemos.
tabla2_groupby_a침o.ngroups

147

In [13]:
ataques_a침os2 = tabla2.groupby("YEAR")["CASE NUMBER"].count()
ataques_a침os2.head()

YEAR
0.0       125
5.0         1
77.0        1
500.0       1
1543.0      1
Name: CASE NUMBER, dtype: int64

In [14]:
ataquesa침os2 = pd.DataFrame(list(ataques_a침os2.items()), columns=['A칌OS', 'CASOS'])
ataquesa침os2

       A칌OS  CASOS
0       0.0    125
1       5.0      1
2      77.0      1
3     500.0      1
4    1543.0      1
..      ...    ...
142  2014.0      0
143  2015.0      0
144  2016.0      0
145  2017.0      0
146  2018.0      0

[147 rows x 2 columns]

In [15]:
ataquesa침os2_ordenado = ataquesa침os2.sort_values('CASOS')
ataquesa침os2_ordenado.head()

      A칌OS  CASOS
73  1945.0      0
94  1966.0      0
95  1967.0      0
96  1968.0      0
97  1969.0      0

3. 쮺u치ntos ataques hubo por a침o y sexo? Devolved un DataFrame solo del a침o 2000 en adelante.

In [16]:
ataques_a침os_sexo = tabla2.groupby("SEX ")["YEAR"].count()
ataques_a침os_sexo

SEX
F     15
M    141
Name: YEAR, dtype: int64

In [17]:
ataques_a침os_sexo2 = pd.DataFrame(list(ataques_a침os_sexo.items()), columns=['SEX ','YEAR'])
ataques_a침os_sexo2

  SEX   YEAR
0    F    15
1    M   141

4. Primero extraed solo las filas que correspondan a USA, AUSTRALIA y SOUTH AFRICA. 쮺u치ntos de los ataques fueron letales por sexo? Devuelve un DataFrame.

In [18]:
ataques_pais = tabla2.groupby("COUNTRY")["FATAL (Y/N)"].count()
ataques_pais

COUNTRY
AMERICAN SAMOA      2
ARGENTINA           1
ASIA?               1
AUSTRALIA         343
BAHAMAS            29
                 ...
URUGUAY             2
USA               740
VANUATU             4
VENEZUELA           4
VIETNAM             5
Name: FATAL (Y/N), Length: 95, dtype: int64

In [19]:
ataques_pais2 = pd.DataFrame(list(ataques_pais.items()), columns=['COUNTRY ','FATAL'])
ataques_pais2

          COUNTRY   FATAL
0   AMERICAN SAMOA      2
1        ARGENTINA      1
2            ASIA?      1
3        AUSTRALIA    343
4          BAHAMAS     29
..             ...    ...
90         URUGUAY      2
91             USA    740
92         VANUATU      4
93       VENEZUELA      4
94         VIETNAM      5

[95 rows x 2 columns]

5. Usando el DataFrame creado en el ejercicio anterior. 쮼n qu칠 pa칤s hubo m치s ataques?

In [24]:
mas_ataques = ataques_pais2.sort_values("FATAL", ascending=False)
mas_ataques

        COUNTRY   FATAL
91           USA    740
3      AUSTRALIA    343
78  SOUTH AFRICA    234
4        BAHAMAS     29
59   NEW ZEALAND     21
..           ...    ...
68      RED SEA?      1
22   EL SALVADOR      1
47         LIBYA      1
34       ICELAND      0
70        ROATAN      0

[95 rows x 2 columns]

6. 쯈u칠 y cu치ntos tipos de ataques hubo por pa칤s?

In [53]:
tipos_ataques_pais = pd.DataFrame(tabla2.groupby("COUNTRY")["TYPE"].value_counts())
tipos_ataques_pais.head()

                           TYPE
COUNTRY        TYPE
AMERICAN SAMOA Unprovoked     2
ARGENTINA      Unprovoked     1
ASIA?          Unprovoked     1
AUSTRALIA      Unprovoked   290
               Provoked      27